/*
 * ＜お題＞
 * 繰り返し処理を活用してカレンダーを出力させる
 * ・2024年4月をモデルとし、日曜から日付を出力する
 * ・1日が月曜なので、一番最初の出力のみ「-」とする
 * ・数字を出力するごとに半角スペースを空けて見やすくする
 * ・7個の数字毎に改行され、最終的に1~30までが表示される
 */

public class CalenderDist {
    public static void main(String[] args) {

        // 日付管理用の配列
        int[][] days = {
                { 0, 1, 2, 3, 4, 5, 6 },
                { 7, 8, 9, 10, 11, 12, 13 },
                { 14, 15, 16, 17, 18, 19, 20 },
                { 21, 22, 23, 24, 25, 26, 27 },
                { 28, 29, 30 }
        };

        // 実装
    }
}
